# IsFontUnderline Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..IsFontUnderline Property
TableCellStyle Class See Also
---
Gets or sets whether the text font is set to Underline of this cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFontUnderline { get; set; }
```

Visual Basic
---
```text
Public Property IsFontUnderline As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsFontUnderline {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
true if the font is Underline; otherwise false.
# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace